
## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/90497050/runs/c0a2b9e7-8195-4617-877c-49e61c8879ee).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>

## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket.test_bucket will be created
+   resource "google_storage_bucket" "test_bucket" {
+       force_destroy               = true
+       id                          = (known after apply)
+       labels                      = {
+           "environment" = "playground"
        }
+       location                    = "US"
+       name                        = "terraform-playground-bucket-468422"
+       project                     = (known after apply)
+       public_access_prevention    = (known after apply)
+       self_link                   = (known after apply)
+       storage_class               = "STANDARD"
+       uniform_bucket_level_access = true
+       url                         = (known after apply)
+
       versioning {
+           enabled = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.0 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.0 | 0.0 | 0.0 |
| | **Total** | **0.0** | **0.0** | **0.0** |

</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>